In [317]:
import pandas as pd
import matplotlib.pyplot as plt

In [318]:
train = pd.read_csv('dataset/train.csv')
test = pd.read_csv('dataset/test.csv')

# 1. Exploratory Data Analysis (EDA)
## 1.1. Scanning the features and classes

In [319]:
train.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [320]:
test.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [332]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
train.info()

In [ ]:
train['Embarked'].value_counts()

## 1.2. Checking and handling missing values
### Train set:

In [ ]:
train.isna().sum()

In [ ]:
train.isna().sum().plot(kind='bar')
plt.show()

In our case, we have 177, 687 and 2 NaN for Age, Cabin and Embarked features respectively.

In [ ]:
train['Age'].mean()

### Filling the missing values of the 'Age' column with the mean value

In [ ]:
train_age_mean = int(train['Age'].mean())  # equal to 29
train['Age'] = train['Age'].fillna(train_age_mean)

The entire 'Cabin' deature will be deleted as there are 687 NaN out of 891

In [ ]:
train['Cabin'].value_counts()

In [335]:
train = train.drop('Cabin', axis=1)

Deleting the 2 rows, which are missing the values in Embarked

In [336]:
train = train.dropna()

In [337]:
train.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

### Test set:

In [322]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

The same like the train set will be applied to the test set

There are 86, 327 and 1 missing values for Age, Cabin and Fare features respectively

In [323]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [324]:
test['Age'].mean()

30.272590361445783

In [325]:
test_age_mean = int(test['Age'].mean())  # equal to 29
test['Age'] = test['Age'].fillna(test_age_mean)

In [326]:
test = test.drop('Cabin', axis=1)

In [327]:
test = test.dropna()

In [338]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  417 non-null    int64
 1   Pclass       417 non-null    int64
 2   Name         417 non-null    object
 3   Sex          417 non-null    object
 4   Age          417 non-null    float64
 5   SibSp        417 non-null    int64
 6   Parch        417 non-null    int64
 7   Ticket       417 non-null    object
 8   Fare         417 non-null    float64
 9   Embarked     417 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 35.8+ KB

In [339]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  712 non-null    int64
 1   Survived     712 non-null    int64
 2   Pclass       712 non-null    int64
 3   Name         712 non-null    object
 4   Sex          712 non-null    object
 5   Age          712 non-null    float64
 6   SibSp        712 non-null    int64
 7   Parch        712 non-null    int64
 8   Ticket       712 non-null    object
 9   Fare         712 non-null    float64
 10  Embarked     712 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 66.8+ KB

# 2. Building a Machine Learning Model: